In [1]:
import pandas as pd

In [4]:
df=pd.read_csv("insurance.csv")

In [5]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [7]:
df['smoker']

0       yes
1        no
2        no
3        no
4        no
       ...
1333     no
1334     no
1335     no
1336     no
1337    yes
Name: smoker, Length: 1338, dtype: object

In [8]:
from sklearn.preprocessing import LabelEncoder

In [9]:
encoder=LabelEncoder()

In [10]:
df['smoker']=encoder.fit_transform(df['smoker'])

In [11]:
df.head()

   age     sex     bmi  children  smoker     region      charges
0   19  female  27.900         0       1  southwest  16884.92400
1   18    male  33.770         1       0  southeast   1725.55230
2   28    male  33.000         3       0  southeast   4449.46200
3   33    male  22.705         0       0  northwest  21984.47061
4   32    male  28.880         0       0  northwest   3866.85520

In [12]:
pd.get_dummies(df,columns=['region'],prefix='R')

,age,sex,bmi,children,smoker,charges,R_northeast,R_northwest,R_southeast,R_southwest
0,19,female,27.900,0,1,16884.92400,0,0,0,1
1,18,male,33.770,1,0,1725.55230,0,0,1,0
2,28,male,33.000,3,0,4449.46200,0,0,1,0
3,33,male,22.705,0,0,21984.47061,0,1,0,0
4,32,male,28.880,0,0,3866.85520,0,1,0,0
...,...,...,...,...,...,...,...,...,...,...
1333,50,male,30.970,3,0,10600.54830,0,1,0,0
1334,18,female,31.920,0,0,2205.98080,1,0,0,0
1335,18,female,36.850,0,0,1629.83350,0,0,1,0
1336,21,female,25.800,0,0,2007.94500,0,0,0,1
1337,61,female,29.070,0,1,29141.36030,0,1,0,0

In [13]:
from sklearn.preprocessing import OneHotEncoder

In [17]:
from sklearn.compose import ColumnTransformer

In [32]:
transfer=ColumnTransformer([('One',OneHotEncoder(),[5])],remainder='passthrough')

In [33]:
df.head()

   age     sex     bmi  children  smoker     region      charges
0   19  female  27.900         0       1  southwest  16884.92400
1   18    male  33.770         1       0  southeast   1725.55230
2   28    male  33.000         3       0  southeast   4449.46200
3   33    male  22.705         0       0  northwest  21984.47061
4   32    male  28.880         0       0  northwest   3866.85520

In [37]:
a=transfer.fit_transform(df)

In [41]:
a=pd.DataFrame(a)

In [42]:
a.head()

   0  1  2  3   4       5       6  7  8        9
0  0  0  0  1  19  female    27.9  0  1  16884.9
1  0  0  1  0  18    male   33.77  1  0  1725.55
2  0  0  1  0  28    male      33  3  0  4449.46
3  0  1  0  0  33    male  22.705  0  0  21984.5
4  0  1  0  0  32    male   28.88  0  0  3866.86

In [43]:
#scaling in notes

In [44]:
data=["yesterday was new year","everyday is new year"]

In [45]:
from sklearn.feature_extraction.text import CountVectorizer

In [46]:
count=CountVectorizer()

In [47]:
newdata=count.fit_transform(data)

In [48]:
newdata.toarray()

array([[0, 0, 1, 1, 1, 1],
       [1, 1, 1, 0, 1, 0]], dtype=int64)

In [49]:
count.vocabulary_

{'yesterday': 5, 'was': 3, 'new': 2, 'year': 4, 'everyday': 0, 'is': 1}

In [1]:
text=["this is a simple document","this is second document"]

In [2]:
from sklearn.feature_extraction.text import CountVectorizer,TfidfVectorizer

In [3]:
count=CountVectorizer()

In [6]:
out=count.fit_transform(text)

In [7]:
out.toarray()

array([[1, 1, 0, 1, 1],
       [1, 1, 1, 0, 1]], dtype=int64)

In [8]:
tfidf=TfidfVectorizer()

In [9]:
out=tfidf.fit_transform(text)

In [10]:
out.toarray()

array([[0.44832087, 0.44832087, 0.        , 0.63009934, 0.44832087],
       [0.44832087, 0.44832087, 0.63009934, 0.        , 0.44832087]])